from dataclasses import dataclass

# 디버깅이 필요한 경우에만, True로 값 변경
debug_dl = False

# 바꾸는 값 ########################################################################
file_path = r"C:\Users\User\OneDrive\바탕 화면\hyundai\songs\U Cant Touch This.mp3"
##################################################################################

@dataclass
class UART:
	# 바꾸는 값 ####################################################################
	serial_port: str = 'COM3' # Jongsoo's laptop
	baud_rate: int = 38400
	##############################################################################

@dataclass
class Ethernet:
	# 바꾸는 값 ####################################################################
	host_ip: str = '10.0.0.1' # Your host (Jetson)'s IP
	port: int = 12345 # Your host's port
	client_ip: str = '10.0.0.2'
	##############################################################################